<template>
  <svg
    v-bind="$attrs"
    width="32"
    height="32"
    viewBox="0 0 32 32"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    style="margin-right: 5px; cursor: pointer; fill: rgb(190, 190, 190);"
  >
    <title>Назад</title>
    <path d="M7.84996 15.7L15.6999 7.85V12.56H21.9799V18.84H15.6999V23.55L7.84996 15.7ZM31.3998 15.7C31.3998 24.3711 24.371 31.4 15.6999 31.4C7.02885 31.4 0 24.3711 0 15.7C0 7.02889 7.02885 0 15.6999 0C24.371 0 31.3998 7.02889 31.3998 15.7ZM28.2599 15.7C28.2599 8.76374 22.6361 3.14 15.6999 3.14C8.76369 3.14 3.13998 8.76374 3.13998 15.7C3.13998 22.6363 8.76369 28.26 15.6999 28.26C22.6361 28.26 28.2599 22.6363 28.2599 15.7Z" fill="#1FA5FF" /></svg>
</template>

<script>
export default {
  name: 'SvgBack'
}
</script>
